---
kind: type
id: T:Autodesk.Revit.DB.BooleanOperationsType
source: html/46aeb9cd-4b44-0dcf-6f78-469c1271f5d4.htm
---
# Autodesk.Revit.DB.BooleanOperationsType

An enumerated type listing boolean types that are supported for boolean operation.

## Syntax (C#)
```csharp
public enum BooleanOperationsType
```